artillery/balanceador-100.yml
config:
  target: "http://frontend-balancer"
  processor: "./processor.js"
  phases:
    - duration: 10
      arrivalCount: 100
      name: "100 usuarios concurrentes"
  defaults:
    headers:
      User-Agent: "Artillery Load Test - 100 usuarios"

scenarios:
  - name: "Prueba 100 usuarios"
    flow:
      - loop:
          - get:
              url: "/"
              afterResponse: "countNode"
          - think: 1
        count: 30