artillery/balanceador-1000.yml
config:
  target: "http://frontend-balancer"
  processor: "./processor.js"
  phases:
    - duration: 30
      arrivalCount: 1000
      name: "1000 usuarios concurrentes"
  defaults:
    headers:
      User-Agent: "Artillery Load Test - 1000 usuarios"

scenarios:
  - name: "Prueba 1000 usuarios"
    flow:
      - loop:
          - get:
              url: "/"
              afterResponse: "countNode"
          - think: 1
        count: 30