artillery/balanceador-500.yml
config:
  target: "http://frontend-balancer"
  processor: "./processor.js"
  phases:
    - duration: 20
      arrivalCount: 500
      name: "500 usuarios concurrentes"
  defaults:
    headers:
      User-Agent: "Artillery Load Test - 500 usuarios"

scenarios:
  - name: "Prueba 500 usuarios"
    flow:
      - loop:
          - get:
              url: "/"
              afterResponse: "countNode"
          - think: 1
        count: 30